The latest schema in us-east-1 has fixed the issue. Was able to build the provider with the suppression removed. Tests below.

@nam054 @jar-b @ewbankkit 

Creation: 

```
  + create

Terraform will perform the following actions:

  # awscc_dsql_cluster.this will be created
  + resource "awscc_dsql_cluster" "this" {
      + creation_time               = (known after apply)
      + deletion_protection_enabled = false
      + id                          = (known after apply)
      + identifier                  = (known after apply)
      + resource_arn                = (known after apply)
      + status                      = (known after apply)
      + tags                        = [
          + {
              + key   = "Name"
              + value = "test"
            },
        ]
      + vpc_endpoint_service_name   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_dsql_cluster.this: Creating...
awscc_dsql_cluster.this: Still creating... [00m10s elapsed]
awscc_dsql_cluster.this: Still creating... [00m20s elapsed]
awscc_dsql_cluster.this: Still creating... [00m30s elapsed]
awscc_dsql_cluster.this: Still creating... [00m40s elapsed]
awscc_dsql_cluster.this: Still creating... [00m50s elapsed]
awscc_dsql_cluster.this: Still creating... [01m00s elapsed]
awscc_dsql_cluster.this: Still creating... [01m10s elapsed]
awscc_dsql_cluster.this: Still creating... [01m20s elapsed]
awscc_dsql_cluster.this: Still creating... [01m30s elapsed]
awscc_dsql_cluster.this: Still creating... [01m40s elapsed]
awscc_dsql_cluster.this: Still creating... [01m50s elapsed]
awscc_dsql_cluster.this: Still creating... [02m00s elapsed]
awscc_dsql_cluster.this: Still creating... [02m10s elapsed]
awscc_dsql_cluster.this: Creation complete after 2m11s [id=zyabudpnl2pmk4q6xac77ucat4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Idempotency check:

```
awscc_dsql_cluster.this: Refreshing state... [id=zyabudpnl2pmk4q6xac77ucat4]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no
differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```

Deletion:

```
Terraform will perform the following actions:

  # awscc_dsql_cluster.this will be destroyed
  - resource "awscc_dsql_cluster" "this" {
      - creation_time               = "2025-05-29T01:16:42.455Z" -> null
      - deletion_protection_enabled = false -> null
      - id                          = "zyabudpnl2pmk4q6xac77ucat4" -> null
      - identifier                  = "zyabudpnl2pmk4q6xac77ucat4" -> null
      - resource_arn                = "arn:aws:dsql:us-east-1:############:cluster/zyabudpnl2pmk4q6xac77ucat4" -> null
      - status                      = "ACTIVE" -> null
      - tags                        = [
          - {
              - key   = "Name" -> null
              - value = "test" -> null
            },
        ] -> null
      - vpc_endpoint_service_name   = "com.amazonaws.us-east-1.dsql-fnh4" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
awscc_dsql_cluster.this: Destroying... [id=zyabudpnl2pmk4q6xac77ucat4]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 00m10s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 00m20s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 00m30s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 00m40s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 00m50s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m00s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m10s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m20s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m30s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m40s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 01m50s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 02m00s elapsed]
awscc_dsql_cluster.this: Still destroying... [id=zyabudpnl2pmk4q6xac77ucat4, 02m10s elapsed]
awscc_dsql_cluster.this: Destruction complete after 2m13s

Destroy complete! Resources: 1 destroyed.


```

![Image](https://github.com/user-attachments/assets/2951443a-cf58-4f1c-ad77-988327a5b88f)